windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D14, peripheral: WDOG1, signal: wdog_b, pin_signal: GPIO_B1_13}
  - {pin_num: J12, peripheral: ADC1, signal: 'IN, 11', pin_signal: GPIO_AD_B1_06, identifier: ADC1, slew_rate: Fast}
  - {pin_num: K10, peripheral: ADC2, signal: 'IN, 12', pin_signal: GPIO_AD_B1_07, identifier: ADC2, slew_rate: Fast}
  - {pin_num: H14, peripheral: GPIO1, signal: 'gpio_io, 14', pin_signal: GPIO_AD_B0_14, identifier: DEBUG_TP1, direction: OUTPUT}
  - {pin_num: L10, peripheral: GPIO1, signal: 'gpio_io, 15', pin_signal: GPIO_AD_B0_15, identifier: DEBUG_TP2, direction: OUTPUT}
  - {pin_num: J11, peripheral: GPIO1, signal: 'gpio_io, 16', pin_signal: GPIO_AD_B1_00, identifier: AN_SW_EN1, direction: OUTPUT}
  - {pin_num: M12, peripheral: GPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AD_B1_03, identifier: ADD_MUX11, direction: OUTPUT}
  - {pin_num: L12, peripheral: GPIO1, signal: 'gpio_io, 20', pin_signal: GPIO_AD_B1_04, identifier: ADD_MUX12, direction: OUTPUT}
  - {pin_num: K12, peripheral: GPIO1, signal: 'gpio_io, 21', pin_signal: GPIO_AD_B1_05, identifier: ADD_MUX13, direction: OUTPUT}
  - {pin_num: J13, peripheral: GPIO1, signal: 'gpio_io, 27', pin_signal: GPIO_AD_B1_11, identifier: LED_HGROUP_DATA, direction: OUTPUT}
  - {pin_num: G12, peripheral: GPIO1, signal: 'gpio_io, 30', pin_signal: GPIO_AD_B1_14, identifier: ADC_GROUP_SELECT_0, direction: OUTPUT}
  - {pin_num: J14, peripheral: GPIO1, signal: 'gpio_io, 31', pin_signal: GPIO_AD_B1_15, identifier: ADC_GROUP_SELECT_1, direction: OUTPUT}
  - {pin_num: D7, peripheral: GPIO2, signal: 'gpio_io, 00', pin_signal: GPIO_B0_00, identifier: LED_CELL_CTRL1, direction: OUTPUT}
  - {pin_num: E7, peripheral: GPIO2, signal: 'gpio_io, 01', pin_signal: GPIO_B0_01, identifier: LED_CELL_CTRL2, direction: OUTPUT}
  - {pin_num: E8, peripheral: GPIO2, signal: 'gpio_io, 02', pin_signal: GPIO_B0_02, identifier: LED_CELL_CTRL3, direction: OUTPUT}
  - {pin_num: A11, peripheral: GPIO2, signal: 'gpio_io, 16', pin_signal: GPIO_B1_00, identifier: SINK_DAC_0, direction: OUTPUT}
  - {pin_num: B11, peripheral: GPIO2, signal: 'gpio_io, 17', pin_signal: GPIO_B1_01, identifier: SINK_DAC_1, direction: OUTPUT}
  - {pin_num: C11, peripheral: GPIO2, signal: 'gpio_io, 18', pin_signal: GPIO_B1_02, identifier: SINK_DAC_2, direction: OUTPUT}
  - {pin_num: D11, peripheral: GPIO2, signal: 'gpio_io, 19', pin_signal: GPIO_B1_03, identifier: SINK_DAC_3, direction: OUTPUT}
  - {pin_num: E12, peripheral: GPIO2, signal: 'gpio_io, 20', pin_signal: GPIO_B1_04, identifier: SINK_DAC_4, direction: OUTPUT}
  - {pin_num: D12, peripheral: GPIO2, signal: 'gpio_io, 21', pin_signal: GPIO_B1_05, identifier: SINK_DAC_5, direction: OUTPUT}
  - {pin_num: C12, peripheral: GPIO2, signal: 'gpio_io, 22', pin_signal: GPIO_B1_06, identifier: SINK_DAC_6, direction: OUTPUT}
  - {pin_num: B12, peripheral: GPIO2, signal: 'gpio_io, 23', pin_signal: GPIO_B1_07, identifier: SINK_DAC_7, direction: OUTPUT}
  - {pin_num: A12, peripheral: GPIO2, signal: 'gpio_io, 24', pin_signal: GPIO_B1_08, identifier: LED_CELL_EN, direction: OUTPUT}
  - {pin_num: A13, peripheral: GPIO2, signal: 'gpio_io, 25', pin_signal: GPIO_B1_09, identifier: LED_GROUP_CLK, direction: OUTPUT}
  - {pin_num: B13, peripheral: GPIO2, signal: 'gpio_io, 26', pin_signal: GPIO_B1_10, identifier: LED_GROUP_EN, direction: OUTPUT}
  - {pin_num: C13, peripheral: GPIO2, signal: 'gpio_io, 27', pin_signal: GPIO_B1_11, identifier: PD_SHIFT_CLK, direction: OUTPUT}
  - {pin_num: C14, peripheral: GPIO2, signal: 'gpio_io, 30', pin_signal: GPIO_B1_14, identifier: PD_SHIFT_DATA, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  /* GPIO configuration of DEBUG_TP1 on GPIO_AD_B0_14 (pin H14) */
  gpio_pin_config_t DEBUG_TP1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_14 (pin H14) */
  GPIO_PinInit(GPIO1, 14U, &DEBUG_TP1_config);

  /* GPIO configuration of DEBUG_TP2 on GPIO_AD_B0_15 (pin L10) */
  gpio_pin_config_t DEBUG_TP2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_15 (pin L10) */
  GPIO_PinInit(GPIO1, 15U, &DEBUG_TP2_config);

//  /* GPIO configuration of AN_SW_EN1 on GPIO_AD_B1_00 (pin J11) */
//  gpio_pin_config_t AN_SW_EN1_config = {
//      .direction = kGPIO_DigitalOutput,
//      .outputLogic = 0U,
//      .interruptMode = kGPIO_NoIntmode
//  };
//  /* Initialize GPIO functionality on GPIO_AD_B1_00 (pin J11) */
//  GPIO_PinInit(GPIO1, 16U, &AN_SW_EN1_config);

  /* GPIO configuration of ADD_MUX11 on GPIO_AD_B1_03 (pin M12) */
  gpio_pin_config_t ADD_MUX11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin M12) */
  GPIO_PinInit(GPIO1, 19U, &ADD_MUX11_config);

  /* GPIO configuration of ADD_MUX12 on GPIO_AD_B1_04 (pin L12) */
  gpio_pin_config_t ADD_MUX12_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_04 (pin L12) */
  GPIO_PinInit(GPIO1, 20U, &ADD_MUX12_config);

