windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.c
  /* GPIO configuration of ADD_MUX13 on GPIO_AD_B1_05 (pin K12) */
  gpio_pin_config_t ADD_MUX13_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_05 (pin K12) */
  GPIO_PinInit(GPIO1, 21U, &ADD_MUX13_config);

//  /* GPIO configuration of ADD_MUX11 on GPIO_AD_B1_03 (pin M12) */
//  gpio_pin_config_t ADD_MUX11_config = {
//      .direction = kGPIO_DigitalOutput,
//      .outputLogic = 0U,
//      .interruptMode = kGPIO_NoIntmode
//  };
//  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin M12) */
//  GPIO_PinInit(GPIO1, 24U, &ADD_MUX11_config);

  /* GPIO configuration of ADD_MUX11 on GPIO_AD_B1_03 (pin M12) */
  gpio_pin_config_t TEST_POING_2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin M12) */
  GPIO_PinInit(GPIO1, 25U, &TEST_POING_2_config);

  /* GPIO configuration of ADD_MUX11 on GPIO_AD_B1_03 (pin M12) */
  gpio_pin_config_t TEST_POING_3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin M12) */
  GPIO_PinInit(GPIO1, 26U, &TEST_POING_3_config);

  /* GPIO configuration of LED_HGROUP_DATA on GPIO_AD_B1_11 (pin J13) */
  gpio_pin_config_t LED_HGROUP_DATA_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_11 (pin J13) */
  GPIO_PinInit(GPIO1, 27U, &LED_HGROUP_DATA_config);

  /* GPIO configuration of ADC_GROUP_SELECT_0 on GPIO_AD_B1_14 (pin G12) */
  gpio_pin_config_t ADC_GROUP_SELECT_0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_14 (pin G12) */
  GPIO_PinInit(GPIO1, 30U, &ADC_GROUP_SELECT_0_config);

  /* GPIO configuration of ADC_GROUP_SELECT_1 on GPIO_AD_B1_15 (pin J14) */
  gpio_pin_config_t ADC_GROUP_SELECT_1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_15 (pin J14) */
  GPIO_PinInit(GPIO1, 31U, &ADC_GROUP_SELECT_1_config);

  /* GPIO configuration of LED_CELL_CTRL1 on GPIO_B0_00 (pin D7) */
  gpio_pin_config_t LED_CELL_CTRL1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_00 (pin D7) */
  GPIO_PinInit(GPIO2, 1U, &LED_CELL_CTRL1_config);

  /* GPIO configuration of LED_CELL_CTRL2 on GPIO_B0_01 (pin E7) */
  gpio_pin_config_t LED_CELL_CTRL2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_01 (pin E7) */
  GPIO_PinInit(GPIO2, 2U, &LED_CELL_CTRL2_config);

  /* GPIO configuration of LED_CELL_CTRL3 on GPIO_B0_02 (pin E8) */
  gpio_pin_config_t LED_CELL_CTRL3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_02 (pin E8) */
  GPIO_PinInit(GPIO2, 3U, &LED_CELL_CTRL3_config);

  /* GPIO configuration of SINK_DAC_0 on GPIO_B1_00 (pin A11) */
  gpio_pin_config_t SINK_DAC_0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_00 (pin A11) */
  GPIO_PinInit(GPIO2, 16U, &SINK_DAC_0_config);

  /* GPIO configuration of SINK_DAC_1 on GPIO_B1_01 (pin B11) */
  gpio_pin_config_t SINK_DAC_1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_01 (pin B11) */
  GPIO_PinInit(GPIO2, 17U, &SINK_DAC_1_config);

  /* GPIO configuration of SINK_DAC_2 on GPIO_B1_02 (pin C11) */
  gpio_pin_config_t SINK_DAC_2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_02 (pin C11) */
  GPIO_PinInit(GPIO2, 18U, &SINK_DAC_2_config);

  /* GPIO configuration of SINK_DAC_3 on GPIO_B1_03 (pin D11) */
  gpio_pin_config_t SINK_DAC_3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_03 (pin D11) */
  GPIO_PinInit(GPIO2, 19U, &SINK_DAC_3_config);

  /* GPIO configuration of SINK_DAC_4 on GPIO_B1_04 (pin E12) */
  gpio_pin_config_t SINK_DAC_4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_04 (pin E12) */
  GPIO_PinInit(GPIO2, 20U, &SINK_DAC_4_config);

  /* GPIO configuration of SINK_DAC_5 on GPIO_B1_05 (pin D12) */
  gpio_pin_config_t SINK_DAC_5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_05 (pin D12) */
  GPIO_PinInit(GPIO2, 21U, &SINK_DAC_5_config);

  /* GPIO configuration of SINK_DAC_6 on GPIO_B1_06 (pin C12) */
  gpio_pin_config_t SINK_DAC_6_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_06 (pin C12) */
  GPIO_PinInit(GPIO2, 22U, &SINK_DAC_6_config);

  /* GPIO configuration of SINK_DAC_7 on GPIO_B1_07 (pin B12) */
  gpio_pin_config_t SINK_DAC_7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_07 (pin B12) */
  GPIO_PinInit(GPIO2, 23U, &SINK_DAC_7_config);

  /* GPIO configuration of PD_SHIFT_CLK on GPIO_B1_11 (pin C13) */
  gpio_pin_config_t PD_SHIFT_CLK_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_11 (pin C13) */
  GPIO_PinInit(GPIO2, 24U, &PD_SHIFT_CLK_config);

  /* GPIO configuration of LED_GROUP_EN on GPIO_B1_10 (pin B13) */
  gpio_pin_config_t LED_GROUP_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_10 (pin B13) */
  GPIO_PinInit(GPIO2, 26U, &LED_GROUP_EN_config);

